app/controllers/v1/appointments_controller.rb

  def create

    trainer = Trainer.find_by(api_token: params["trainer_id"])
    check_appointment_type(params) or return
    check_exists(trainer, "trainer") or return

    if !Appointment.with_deleted.find_by_id(params[:id]).present?

      appointment = trainer.appointments.new(params.except(:action, :controller, :trainer_id).permit!)
      appointment.save
---
SELECT  "appointments".* FROM "appointments" WHERE "appointments"."id" IS NULL LIMIT 1
SELECT  1 AS one FROM "appointments" WHERE ("appointments"."id" = '1c7659e5-9e86-4bf0-a486-211e597ea6ee' AND "appointments"."deleted_at" IS NULL AND "appointments"."id" != '1c7659e5-9e86-4bf0-a486-211e597ea6ee') LIMIT 1
INSERT INTO "appointments" ("client_value_per_week", "start_date", "event_type", "session_rate", "end_date", "sessions_per_week", "start_time", "end_time", "repeat_after", "duration", "trainer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"

  def destroy
    if params["id"]
      appointment = get_appointment
      check_exists appointment or return
      if appointment.get_utc_datetime(app.start_date, app.start_time) < DateTime.now.utc
        appointment.sessions.each do |s|
          if s[:utc_datetime] > DateTime.now.utc
            s.destroy
          end
        end
        appointment_sessions = appointment.sessions.order(utc_datetime: :asc)
        appointment.update_attributes(end_time: (Time.parse(appointment_sessions.last[:time]) + appointment.duration.minutes).to_s(:time), end_date: appointment_sessions.last[:date])
---
UPDATE "appointments" SET "deleted_at" = '2017-08-04 01:15:42.879959', "updated_at" = '2017-08-04 01:15:42.879992' WHERE "appointments"."id" = $1  [["id", "1c7659e5-9e86-4bf0-a486-211e597ea6ee"]]