app/controllers/v1/products_controller.rb

  def index

    offset = params[:offset] || 0
    limit = params[:limit] || 25

    filtered = ::Product.filtered(params).order(product_id: :asc)

    metadata = {total: filtered.count, offset: offset.to_i, limit: limit.to_i}
---
SELECT  "products".* FROM "products" WHERE "products"."deleted_at" IS NULL AND (products.updated_at >= '1970-01-01 00:00:00.000000')  ORDER BY "products"."product_id" ASC LIMIT 100 OFFSET 0
SELECT COUNT(count_column) FROM (SELECT  1 AS count_column FROM "products" WHERE "products"."deleted_at" IS NULL AND (products.updated_at >= '1970-01-01 00:00:00.000000') LIMIT 100 OFFSET 0) subquery_for_count