app/controllers/v1/product_categories_controller.rb

SELECT  "product_categories".* FROM "product_categories" WHERE "product_categories"."deleted_at" IS NULL AND (product_categories.updated_at >= '1970-01-01 00:00:00.000000')  ORDER BY "product_categories"."created_at" ASC LIMIT 100 OFFSET 0
SELECT COUNT(count_column) FROM (SELECT  1 AS count_column FROM "product_categories" WHERE "product_categories"."deleted_at" IS NULL AND (product_categories.updated_at >= '1970-01-01 00:00:00.000000') LIMIT 100 OFFSET 0) subquery_for_count
---
  def index

    offset = params[:offset] || 0
    limit = params[:limit] || 25

    filtered = ::ProductCategory.filtered(params).order(created_at: :asc)

    metadata = {total: filtered.count, offset: offset.to_i, limit: limit.to_i}